# Используем образ с Node.js и npm, основанный на Alpine Linux
FROM node:alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта внутрь контейнера
COPY . .

# Собираем проект
RUN npm run build

# Указываем порт, который будет использоваться при запуске контейнера
EXPOSE 3000

# Запускаем сервер React приложения при запуске контейнера
CMD ["npm", "start"]
